app/views/projects/_form.html.erb

      </select-->
      <%= select("post", "research_line_id", ResearchLine.all.collect {|p| [ p.name, p.id ] }, {prompt: 'Selecciona una línea de investigación'}, class: "ui dropdown",style: "margin-bottom:15px") %>
---
SELECT "research_lines".* FROM "research_lines"

        </div-->
        <%= select("post", "user_id", User.all.collect {|p| [ p.name, p.id ] }, {prompt: 'Selecciona un participante para agregar al proyecto'}, class: "ui dropdown",style: "margin-bottom:15px") %>
---
SELECT "users".* FROM "users"