app/views/projects/show.html.erb

SELECT  "research_groups".* FROM "research_groups" WHERE "research_groups"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  <h1 class="section-heading text-center">Integrantes</h1>
  <h3 class="section-heading text-center"> <%= ResearchGroup.find(@project.research_group_id).name%> </h3>