app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("name", "key_words", "description", "language", "bibliography", "created_at", "updated_at", "pdf") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "pdf" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["pdf", "Tarea4_-_complejidades.pdf"], ["updated_at", "2017-10-09 03:53:55.736007"], ["id", 1]]