app/controllers/home_controller.rb

SELECT COUNT(*) FROM "projects"
SELECT "projects".* FROM "projects"
---
  def index
    case params[:item]
      when "1"
        @items = Project.order('created_at DESC').paginate(page: params[:page], per_page: 6)
      when "2"
        @items = Article.order('created_at DESC').paginate(page: params[:page], per_page: 6)
      when "3"
        @items = ResearchGroup.order('created_at DESC').paginate(page: params[:page], per_page: 6)
      when "4"
        @items = User.order('created_at DESC').paginate(page: params[:page], per_page: 6)
      else
        projects = Project.all