app/controllers/projects_controller.rb

  def index
    @projects = Project.all.paginate(page: params[:page], per_page: 12)
---
SELECT  "projects".* FROM "projects" LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects"

  def show
    @project = Project.find(params[:id])
    @group = ResearchGroup.find(@project.research_group_id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "research_groups".* FROM "research_groups" WHERE "research_groups"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "summary", "git", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["summary", ""], ["git", ""], ["created_at", "2017-09-29 14:50:26.726432"], ["updated_at", "2017-09-29 14:50:26.726432"]]