app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
    @group = ResearchGroup.find(@project.research_group_id)
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]