app/controllers/research_groups_controller.rb

SELECT "research_groups".* FROM "research_groups"
---
  def index
    @research_groups = ResearchGroup.all.paginate(page: params[:page], per_page: 12)