app/views/users/registrations/edit.html.erb

          <h4 class="ui header">Departamento</h4>
          <%= select("post", "research_line_id", ResearchLine.all.collect {|p| [ p.name, p.id ] }, {prompt: 'Selecciona un departamento'}, class: "ui dropdown",style: "margin-bottom:15px") %>
---
SELECT "research_lines".* FROM "research_lines"